# Assignment for Quantitative Analyst - Intern at Home.LLC

### Task
Find publicly available data for key factors that influence US home prices nationally. 

Then, build a data science model that explains how these factors impacted home prices over the last 20 years.

## Approach

 1) Data Collection

 2) Data Preprocessing

 3) EDA & Building data science model (Machine Learning Model)

 4) Analyse the Results

### 1. Data Collection
Firstly, to determine the key factors that influence US Home Prices nationally, a thorough research was conducted.

Few sites and published papers were referred and some basic assumptions were made to find out the following key factors:

Articles Referred: https://www.sciencedirect.com/science/article/pii/S2666764923000383#:~:text=This%20study%20identifies%20eight%20economic,S%26P%20500%2C%20and%20government%20expenditure.

https://utkarshsinghx27.medium.com/exploring-the-impact-of-supply-demand-factors-on-us-home-prices-a-20-year-analysis-467b17447c21

https://www.westernasset.com/us/en/research/blog/deciphering-factors-that-impact-the-us-housing-market-2024-03-13.cfm

#### 1) CPI - One of the most popular measures of inflation and deflation. It is a measure of the average change over time in the prices paid by urban consumers for a market basket of consumer goods and services.


#### 2) Federal Funds Rate - It is the interest rate at which depository institutions lend reserve balances to other depository institutions overnight on an uncollateralized basis.


#### 3) Real GDP - It is an inflation-adjusted measure that reflects the value of all goods and services produced by an economy in a given year.


#### 4) Real Disposable Income per capita - It determines an individual's ability to purchase goods or services.


#### 5) Mortgage Rate - It is the interest rate charged for a home loan.


#### 6) Population


#### 7) S&P 500 - It is a stock market index tracking the stock performance of 500 of the largest companies listed on stock exchanges in the United States.


#### 8) Unemployment Rate 

#### S&P US Case-Shiller Home Price Index as a proxy for home prices.


The data for above factors was obtained from following websites:
https://fred.stlouisfed.org/series/

https://www.spglobal.com/marketintelligence/en/mi/products/us-monthly-gdp-index.html

https://finance.yahoo.com/quote/%5EGSPC/history/?guccounter=1&guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&guce_referrer_sig=AQAAABhPBaxqA-t4rzetBd4ax0Qxoad29mqpo0-zKsbOntahO8RW5Qx8X7DOQsRuPBbxfR6AmvfOIEXNgS2BWGRoIzBxq4GrCf1HbbppRe3I7UUJDUBk809N5oHLyGXCOjVhx9bu0DWYsR8YKHEXZ5SuJzc7moBUIfxJtj7Ngw9bmic0&frequency=1mo&period1=694224000&period2=1717848110

### 2. Data Preprocessing

To make data ready for analysis, preprocessing techniques such as cleaning, transforming, and integrating of data are performed which are described further in the notebook. 

The data collected from various sources is combined to form a single dataframe for efficient analysis and model building.

#### Since we're interested to find the impact in last 20 years, we'll be considering the data from 1st Jan 2004 to 1st Dec 2023.

#### The US Case-Shiller Home Price Inded is Monthly data, hence we'll be transforming data to monthly wherever necessary

### 3. EDA & Building data science model (Machine Learning Model)

Included in Model_Building.ipynb notebook

Exploratory Data Analysis is performed on the data to gain more insights and to learn hidden patterns present in the data.

### 4. Analyse the results

Determine how each factor has historically impacted home prices.

Evaluate the overall performance of your model using metrics like R-squared, Mean Absolute Error (MAE), and Root Mean Squared Error (RMSE).

Understanding Coefficients (For Linear Models)

Feature Importance (For Tree-based Models)

In [152]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import warnings
warnings.filterwarnings('ignore')

#### Preprocessing Case-Shiller U.S. National Home Price Index Data

In [3]:
data = pd.read_csv("CSUSHPISA.csv")
data.head()

         DATE  CSUSHPISA
0  1987-01-01     63.965
1  1987-02-01     64.425
2  1987-03-01     64.735
3  1987-04-01     65.132
4  1987-05-01     65.564

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 447 entries, 0 to 446
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   DATE       447 non-null    object
 1   CSUSHPISA  447 non-null    float64
dtypes: float64(1), object(1)
memory usage: 7.1+ KB

In [5]:
# Converting the data type of DATE column to datetime 
data['DATE'] = pd.to_datetime(data['DATE'], format='%Y-%m-%d')

# Filtering the DataFrame to keep only 20 years data
start_date = '2004-01-01'
end_date = '2023-12-01'
CSHPI = data[(data['DATE'] >= start_date) & (data['DATE'] <= end_date)]

In [8]:
CSHPI.head()

          DATE  CSUSHPISA
204 2004-01-01    141.646
205 2004-02-01    143.191
206 2004-03-01    145.058
207 2004-04-01    146.592
208 2004-05-01    148.185

In [9]:
CSHPI.info()

<class 'pandas.core.frame.DataFrame'>
Index: 240 entries, 204 to 443
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   DATE       240 non-null    datetime64[ns]
 1   CSUSHPISA  240 non-null    float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 5.6 KB

#### Preprocessing Consumer Price Index data

In [10]:
#Consumer Price Index
data = pd.read_csv("CPIAUCSL.csv")
data.head()

         DATE  CPIAUCSL
0  1947-01-01     21.48
1  1947-02-01     21.62
2  1947-03-01     22.00
3  1947-04-01     22.00
4  1947-05-01     21.95

In [11]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 928 entries, 0 to 927
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   DATE      928 non-null    object
 1   CPIAUCSL  928 non-null    float64
dtypes: float64(1), object(1)
memory usage: 14.6+ KB

In [12]:
# Converting the data type of DATE column to datetime 
data['DATE'] = pd.to_datetime(data['DATE'], format='%Y-%m-%d')

# Filtering the DataFrame to keep only 20 years data
start_date = '2004-01-01'
end_date = '2023-12-01'
CPI = data[(data['DATE'] >= start_date) & (data['DATE'] <= end_date)]

In [14]:
CPI.tail()

          DATE  CPIAUCSL
919 2023-08-01   306.187
920 2023-09-01   307.288
921 2023-10-01   307.531
922 2023-11-01   308.024
923 2023-12-01   308.742

#### Preprocessing Federal Funds Rate data

In [15]:
#Federal Funds Rate (Interest Rate)
data = pd.read_csv("FEDFUNDS.csv")
data.head()

         DATE  FEDFUNDS
0  1954-07-01      0.80
1  1954-08-01      1.22
2  1954-09-01      1.07
3  1954-10-01      0.85
4  1954-11-01      0.83

In [16]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 839 entries, 0 to 838
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   DATE      839 non-null    object
 1   FEDFUNDS  839 non-null    float64
dtypes: float64(1), object(1)
memory usage: 13.2+ KB

In [17]:
# Converting the data type of DATE column to datetime 
data['DATE'] = pd.to_datetime(data['DATE'], format='%Y-%m-%d')

# Filtering the DataFrame to keep only 20 years data
start_date = '2004-01-01'
end_date = '2023-12-01'
FEDFND = data[(data['DATE'] >= start_date) & (data['DATE'] <= end_date)]

In [19]:
FEDFND.tail()

          DATE  FEDFUNDS
829 2023-08-01      5.33
830 2023-09-01      5.33
831 2023-10-01      5.33
832 2023-11-01      5.33
833 2023-12-01      5.33

#### Preprocessing Monthly GDP Data

In [153]:
#Monthly Real GDP
data = pd.read_csv("MonthlyGDP_US.csv")
data.head()

,Unnamed: 0,Monthly Nominal GDP Index,Monthly Real GDP Index,Unnamed: 3,Unnamed: 4
0,1992 - Jan,6315.725,10177.827,NaN,NaN
1,1992 - Feb,6356.505,10222.906,NaN,NaN
2,1992 - Mar,6417.077,10307.949,NaN,NaN
3,1992 - Apr,6443.256,10314.307,NaN,NaN
4,1992 - May,6433.810,10293.475,NaN,NaN

The format of date (Unnamed: 0) column is not ideal. Hence we'll be taking necessary steps to make it suitable for further analysis.

In [154]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 395 entries, 0 to 394
Data columns (total 5 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Unnamed: 0                 385 non-null    object
 1   Monthly Nominal GDP Index  385 non-null    float64
 2   Monthly Real GDP Index     385 non-null    float64
 3   Unnamed: 3                 0 non-null      float64
 4   Unnamed: 4                 0 non-null      float64
dtypes: float64(4), object(1)
memory usage: 15.6+ KB

In [155]:
data.rename(columns = {'Unnamed: 0':'DATE'}, inplace = True)

In [156]:
data.drop(['Unnamed: 3', 'Unnamed: 4', 'Monthly Nominal GDP Index'], axis=1, inplace= True)

In [157]:
data.head()

         DATE  Monthly Real GDP Index
0  1992 - Jan               10177.827
1  1992 - Feb               10222.906
2  1992 - Mar               10307.949
3  1992 - Apr               10314.307
4  1992 - May               10293.475

In [158]:
data.isna().sum()

DATE                      10
Monthly Real GDP Index    10
dtype: int64

 There are null values in the dataset.

In [159]:
data

           DATE  Monthly Real GDP Index
0    1992 - Jan               10177.827
1    1992 - Feb               10222.906
2    1992 - Mar               10307.949
3    1992 - Apr               10314.307
4    1992 - May               10293.475
..          ...                     ...
390         NaN                     NaN
391         NaN                     NaN
392         NaN                     NaN
393         NaN                     NaN
394         NaN                     NaN

[395 rows x 2 columns]

In [160]:
# dropping the rows with null values in the dataset
data = data.dropna()

In [161]:
data.isna().sum()

DATE                      0
Monthly Real GDP Index    0
dtype: int64

There is no loss of data after dropping the null values. As all null values were at last 10 rows of the dataset and not in between.

In [162]:
from dateutil.parser import parse

def convert_date(date_str):
    # Appending ' -01' to the date string to make it YYYY - Mon -01
    date_str_with_day = date_str + ' -01'
    # Parsing the date string using dateutil.parser
    return parse(date_str_with_day)

# Applying the conversion function to the 'DATE' column
data['DATE'] = data['DATE'].apply(convert_date)

In [163]:
data.tail()

          DATE  Monthly Real GDP Index
380 2023-09-01               22561.706
381 2023-10-01               22509.894
382 2023-11-01               22686.169
383 2023-12-01               22846.137
384 2024-01-01               22670.215

In [164]:
data['DATE'] = pd.to_datetime(data['DATE'], format='%Y-%m-%d')

# Filtering the DataFrame to keep only 20 years data
start_date = '2004-01-01'
end_date = '2023-12-01'
RGDP = data[(data['DATE'] >= start_date) & (data['DATE'] <= end_date)]

In [165]:
RGDP.tail()

          DATE  Monthly Real GDP Index
379 2023-08-01               22502.076
380 2023-09-01               22561.706
381 2023-10-01               22509.894
382 2023-11-01               22686.169
383 2023-12-01               22846.137

#### Preprocessing Disposable Income Per Capita data

In [132]:
#Real Disposable Income Per Capita
data = pd.read_csv('disposable_income.csv')
data.head()

         DATE  A229RX0
0  1959-01-01  13186.0
1  1959-02-01  13209.0
2  1959-03-01  13267.0
3  1959-04-01  13336.0
4  1959-05-01  13392.0

In [133]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 784 entries, 0 to 783
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   DATE     784 non-null    object
 1   A229RX0  784 non-null    float64
dtypes: float64(1), object(1)
memory usage: 12.4+ KB

In [134]:
data['DATE'] = pd.to_datetime(data['DATE'], format='%Y-%m-%d')

# Filtering the DataFrame to keep only 20 years data
start_date = '2004-01-01'
end_date = '2023-12-01'
DIncome = data[(data['DATE'] >= start_date) & (data['DATE'] <= end_date)]

In [141]:
DIncome.rename(columns={'A229RX0':'DIncome'}, inplace=True)

In [142]:
DIncome.head()

          DATE  DIncome
540 2004-01-01  37840.0
541 2004-02-01  37884.0
542 2004-03-01  38011.0
543 2004-04-01  38111.0
544 2004-05-01  38272.0

#### Preprocessing Mortgage Rate data

In [169]:
#Mortgage rates
data = pd.read_csv("MORTGAGE30US.csv")
data.head()

         DATE  MORTGAGE30US
0  1971-04-02          7.33
1  1971-04-09          7.31
2  1971-04-16          7.31
3  1971-04-23          7.31
4  1971-04-30          7.29

The Mortgage Rate data is recorded on weekly frequency and our target variable is of monthly frequency.

We'll be taking mean of the weekly data to obtain Monthly average Mortgage Rate

In [170]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2776 entries, 0 to 2775
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   DATE          2776 non-null   object
 1   MORTGAGE30US  2776 non-null   float64
dtypes: float64(1), object(1)
memory usage: 43.5+ KB

In [73]:
data['DATE'] = pd.to_datetime(data['DATE'])

# Setting the 'DATE' column as the index
data.set_index('DATE', inplace=True)

# Resampling the data to monthly frequency, taking the mean of weekly values
monthly_data = data.resample('M').mean()

# Adjusting the 'DATE' index to the first day of each month
monthly_data.index = monthly_data.index.to_period('M').to_timestamp()

# Resetting the index to have 'DATE' as a column again
monthly_data.reset_index(inplace=True)

In [74]:
monthly_data.head()

        DATE  MORTGAGE30US
0 1971-04-01        7.3100
1 1971-05-01        7.4250
2 1971-06-01        7.5300
3 1971-07-01        7.6040
4 1971-08-01        7.6975

In [75]:
# Filtering the DataFrame to keep only 20 years data
start_date = '2004-01-01'
end_date = '2023-12-01'
MG = monthly_data[(monthly_data['DATE'] >= start_date) & (monthly_data['DATE'] <= end_date)]

In [77]:
MG.tail()

          DATE  MORTGAGE30US
628 2023-08-01         7.072
629 2023-09-01         7.200
630 2023-10-01         7.620
631 2023-11-01         7.442
632 2023-12-01         6.815

#### Preprocessing Population (in thousand) data

In [80]:
#Population in the USA in thousand
data = pd.read_csv("POPTHM.csv")
data.head()

         DATE    POPTHM
0  1959-01-01  175818.0
1  1959-02-01  176044.0
2  1959-03-01  176274.0
3  1959-04-01  176503.0
4  1959-05-01  176723.0

In [82]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 784 entries, 0 to 783
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   DATE    784 non-null    object
 1   POPTHM  784 non-null    float64
dtypes: float64(1), object(1)
memory usage: 12.4+ KB

In [83]:
data['DATE'] = pd.to_datetime(data['DATE'], format='%Y-%m-%d')

# Filtering the DataFrame to keep only 20 years data
start_date = '2004-01-01'
end_date = '2023-12-01'
Pop = data[(data['DATE'] >= start_date) & (data['DATE'] <= end_date)]

In [85]:
Pop.tail()

          DATE    POPTHM
775 2023-08-01  335431.0
776 2023-09-01  335612.0
777 2023-10-01  335773.0
778 2023-11-01  335925.0
779 2023-12-01  336070.0

#### Preprocessing S&P 500 Monthly Data

In [86]:
#S&P500 data Monthly
data = pd.read_csv("sp500_monthly_data.csv")
data.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,1992-01-01,417.029999,421.179993,408.640015,408.779999,408.779999,5286280000
1,1992-02-01,408.790009,418.079987,406.339996,412.700012,412.700012,4267610000
2,1992-03-01,412.679993,413.779999,401.940002,403.690002,403.690002,4066240000
3,1992-04-01,403.670013,416.279999,392.410004,414.950012,414.950012,4315840000
4,1992-05-01,414.950012,418.750000,409.850006,415.350006,415.350006,3643980000

In [87]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 390 entries, 0 to 389
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       390 non-null    object
 1   Open       390 non-null    float64
 2   High       390 non-null    float64
 3   Low        390 non-null    float64
 4   Close      390 non-null    float64
 5   Adj Close  390 non-null    float64
 6   Volume     390 non-null    int64
dtypes: float64(5), int64(1), object(1)
memory usage: 21.5+ KB

Here, we're using the close price as it is generally considered the most representative value of the S&P 500 for a given month.

The close price reflects the end-of-period valuation after all market participants have traded, providing a consolidated view of market sentiment and performance.

In [88]:
data.drop(['Open', 'High','Low','Adj Close', 'Volume'], axis=1, inplace= True)

In [90]:
data.rename(columns = {'Date':'DATE'}, inplace = True)

In [91]:
data.head()

         DATE       Close
0  1992-01-01  408.779999
1  1992-02-01  412.700012
2  1992-03-01  403.690002
3  1992-04-01  414.950012
4  1992-05-01  415.350006

In [92]:
data['DATE'] = pd.to_datetime(data['DATE'], format='%Y-%m-%d')

# Filtering the DataFrame to keep only 20 years data
start_date = '2004-01-01'
end_date = '2023-12-01'
SNP = data[(data['DATE'] >= start_date) & (data['DATE'] <= end_date)]

In [94]:
SNP.tail()

          DATE        Close
379 2023-08-01  4507.660156
380 2023-09-01  4288.049805
381 2023-10-01  4193.799805
382 2023-11-01  4567.799805
383 2023-12-01  4769.830078

#### Preprocessing Unemployment Rate data

In [95]:
#Unemployment Rate Monthly
data = pd.read_csv('UNRATE.csv')
data.head()

         DATE  UNRATE
0  1948-01-01     3.4
1  1948-02-01     3.8
2  1948-03-01     4.0
3  1948-04-01     3.9
4  1948-05-01     3.5

In [96]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 917 entries, 0 to 916
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   DATE    917 non-null    object
 1   UNRATE  917 non-null    float64
dtypes: float64(1), object(1)
memory usage: 14.5+ KB

In [97]:
data['DATE'] = pd.to_datetime(data['DATE'], format='%Y-%m-%d')

# Filtering the DataFrame to keep only 20 years data
start_date = '2004-01-01'
end_date = '2023-12-01'
UNP = data[(data['DATE'] >= start_date) & (data['DATE'] <= end_date)]

In [99]:
UNP.tail()

          DATE  UNRATE
907 2023-08-01     3.8
908 2023-09-01     3.8
909 2023-10-01     3.8
910 2023-11-01     3.7
911 2023-12-01     3.7

#### Merging all the dataframes to create a single dataframe

In [171]:
all_data = [CSHPI, CPI, FEDFND, RGDP, MG, Pop, SNP, UNP, DIncome]

In [172]:
merged_data = all_data[0]

In [173]:
# Merging each subsequent DataFrame
for data in all_data[1:]:
    merged_data = pd.merge(merged_data, data, on='DATE')

In [174]:
# Displaying the first few rows of the merged DataFrame to verify
print(merged_data.head())

        DATE  CSUSHPISA  CPIAUCSL  FEDFUNDS  Monthly Real GDP Index  \
0 2004-01-01    141.646     186.3      1.00               15134.366
1 2004-02-01    143.191     186.7      1.01               15258.478
2 2004-03-01    145.058     187.1      1.00               15355.141
3 2004-04-01    146.592     187.4      1.00               15311.370
4 2004-05-01    148.185     188.2      1.00               15446.432

   MORTGAGE30US    POPTHM        Close  UNRATE  DIncome
0        5.7125  292046.0  1131.130005     5.7  37840.0
1        5.6350  292230.0  1144.939941     5.6  37884.0
2        5.4450  292434.0  1126.209961     5.8  38011.0
3        5.8300  292651.0  1107.300049     5.6  38111.0
4        6.2700  292872.0  1120.680054     5.6  38272.0

In [175]:
ot_file_name = 'HousePriceData.csv'
merged_data.to_csv(ot_file_name, index=False)

#### Renaming Columns of Merged Dataframe

In [176]:
NewData = pd.read_csv('HousePriceData.csv')
NewData.head()

,DATE,CSUSHPISA,CPIAUCSL,FEDFUNDS,Monthly Real GDP Index,MORTGAGE30US,POPTHM,Close,UNRATE,DIncome
0,2004-01-01,141.646,186.3,1.00,15134.366,5.7125,292046.0,1131.130005,5.7,37840.0
1,2004-02-01,143.191,186.7,1.01,15258.478,5.6350,292230.0,1144.939941,5.6,37884.0
2,2004-03-01,145.058,187.1,1.00,15355.141,5.4450,292434.0,1126.209961,5.8,38011.0
3,2004-04-01,146.592,187.4,1.00,15311.370,5.8300,292651.0,1107.300049,5.6,38111.0
4,2004-05-01,148.185,188.2,1.00,15446.432,6.2700,292872.0,1120.680054,5.6,38272.0

In [177]:
NewData.rename(columns = {'CSUSHPISA':'Case-ShillerHPI', 'CPIAUCSL':'CPI', 'POPTHM': 'Population(thousands)', 'Close':'S&P500 Close'}, inplace = True)

In [178]:
NewData.head()

,DATE,Case-ShillerHPI,CPI,FEDFUNDS,Monthly Real GDP Index,MORTGAGE30US,Population(thousands),S&P500 Close,UNRATE,DIncome
0,2004-01-01,141.646,186.3,1.00,15134.366,5.7125,292046.0,1131.130005,5.7,37840.0
1,2004-02-01,143.191,186.7,1.01,15258.478,5.6350,292230.0,1144.939941,5.6,37884.0
2,2004-03-01,145.058,187.1,1.00,15355.141,5.4450,292434.0,1126.209961,5.8,38011.0
3,2004-04-01,146.592,187.4,1.00,15311.370,5.8300,292651.0,1107.300049,5.6,38111.0
4,2004-05-01,148.185,188.2,1.00,15446.432,6.2700,292872.0,1120.680054,5.6,38272.0

In [179]:
ot_file_name = 'HousePriceIndexData.csv'
NewData.to_csv(ot_file_name, index=False)